news_rank/app/controllers/articles_controller.rb

  def get_all_articles
    result = []
    # user = current_user
    user = User.find(1)
    feeds = user.feeds
    feeds.each do |feed|

      article_hash = {}
      feed.articles.each do |article|
        article_hash["title"] = article.title
        article_hash["source"] = article.site_url
        article_hash["linkUrl"] = article.canonical_url
        article_hash["imageUrl"] = article.visual_url
        article_hash["timePublished"] = article.published
        article_hash["newsRank"] = article.calculated_rank
        article_hash["summary"] = article.summary
        result << article_hash
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1
SELECT "feeds".* FROM "feeds" INNER JOIN "subscriptions" ON "feeds"."id" = "subscriptions"."feed_id" WHERE "subscriptions"."user_id" = $1  [["user_id", 1]]
SELECT "articles".* FROM "articles"  WHERE "articles"."feed_id" = $1  [["feed_id", 1]]
INSERT INTO "articles" ("author", "canonical_url", "created_at", "feed_id", "feedly_id", "published", "site_url", "summary", "title", "updated_at", "visual_height", "visual_url", "visual_width") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"