news_rank/app/controllers/feeds_controller.rb

  def from_url(feed_url)
    finder = FeedlyFinder.new(feed_url)
    result = finder.find
    feed = Feed.new
      feed.url = result["results"][0]["website"]
      feed.name = result['results'][0]['title']
      feed.num_subscribers = result['results'][0]['subscribers']
      feed.feedly_feed_id = result['results'][0]['feedId']
      feed.description = result['results'][0]['description']
      feed.topics = result['results'][0]['deliciousTags'].join(',')
      feed.save
---
SELECT  "feeds".* FROM "feeds"  WHERE "feeds"."feedly_feed_id" = 'feed/http://freethoughtblogs.com/pharyngula/feed/' LIMIT 1
INSERT INTO "feeds" ("created_at", "description", "feedly_feed_id", "name", "num_subscribers", "topics", "updated_at", "url") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"